Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
char* newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

void sendMessage(const String& message) {
    char* url = nullptr;
    url = getPGMString(urlPushMessage);
    if (https.begin(*client, String(url))) {
        String data;
        data = "{\"message\":\"" + message + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        https.addHeader(String(getPGMString(androidTickerText)), F("You just got a push notification!"));
        https.addHeader(String(getPGMString(androidContentTitle)), F("This is a notification title"));
        https.addHeader(String(getPGMString(androidContentText)), F("Push Notifications are cool"));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void sendMessage(ledDescription_t& led, bool state) {
    char dataMsg[100];
    String stateString = state ? "Включение" : "Выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "Прожектор %s в %s", led.name.c_str(), String(p).c_str());
    delPtr(p);

    char* url = nullptr;
    url = getPGMString(urlPushMessage);
    if (https.begin(*client, String(url))) {
        String data;
        data = "{\"message\":\"" + stateString + "\"}";
        https.addHeader(String(getPGMString(contentType)), String(getPGMString(applicationJson)));
        https.addHeader(String(getPGMString(androidTickerText)), F("You just got a push notification!"));
        https.addHeader(String(getPGMString(androidContentTitle)), F("This is a notification title"));
        https.addHeader(String(getPGMString(androidContentText)), String(dataMsg));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("  Сообщение отправлено"));
        } else {
            Serial.printf_P(PSTR("sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    stateString.clear();
}

void ledOnHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Включение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, HIGH);
        sendMessage(led, true);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = true;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "  Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void ledOffHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Выключение прожектора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, LOW);
        sendMessage(led, false);
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = false;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "  Прожектор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void compressorOnHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Включение компрессора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, HIGH);
        sendMessage(led, true);  // отправка события о включении компрессора
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = true;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "  Компрессор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void compressorOffHandler(ledDescription_t& led) {
    if (led.led.enabled) {
        Serial.printf_P(PSTR("  Выключение компрессора PIN %d\n"), led.led.pin);
        shiftRegister.setPin(countShiftRegister, led.led.pin, LOW);
        sendMessage(led, false);  // отправка события о выключении компрессора
        Alarm.enable(led.led.off);
        Alarm.enable(led.led.on);
        led.led.currentState = false;

        vectorRefLeds.push_back(led);
    } else {
        Serial.printf_P(PSTR("%s\n"), "  Компрессор не доступен для изменения состояния");
        Alarm.disable(led.led.off);
        Alarm.disable(led.led.on);
    }
}

void doserHandler(const doser& dos) {
    String message;
    message = "Включение дозатора " + dos.name;
    sendMessage(message);
    message.clear();

    switch (dos.type) {
        case K:
            doserK->begin();
            doserK->setEnableActiveState(LOW);
            doserK->move(dos.steps);
            doserK->setEnableActiveState(HIGH);
            break;
        case NP:
            doserNP->begin();
            doserNP->setEnableActiveState(LOW);
            doserNP->move(dos.steps);
            doserNP->setEnableActiveState(HIGH);
            break;
        case Fe:
            doserFe->begin();
            doserFe->setEnableActiveState(LOW);
            doserFe->move(dos.steps);
            doserFe->setEnableActiveState(HIGH);
            break;
        default:
            break;
    }
}

